{
  "metadata": {
    "module_id": "intro_eliassen_group_overview",
    "title": "Introduction to Eliassen Group",
    "module_type": "Company Introduction",
    "practice_area": "General",
    "overview": "With over 35 years of experience, Eliassen Group has a proven track record of helping more than 400 clients solve their most complex technology challenges. Our team of 2,500 consultants delivers measurable business outcomes by de-risking major initiatives in data, application development, and cybersecurity.",
    "relevant_roles": ["CTO", "VP Technology", "Director of IT", "Chief Data Officer", "VP Engineering"]
  },
  "content": {
    "email": {
      "subject": "How 400+ clients achieve technology ROI with proven methods",
              "body": "Hi [Prospect Name],\\n\\nNavigating major technology initiatives like data modernization or application overhauls can be challenging, especially when trying to ensure a clear return on investment.\\n\\nEliassen Group has a 35-year track record of helping leaders like you deliver these projects successfully. We focus on tangible outcomes, not just billable hours.\\n\\nFor example, we recently helped a financial services client reduce their infrastructure costs by more than 40% while simultaneously increasing their data processing speed by 10x. This is the kind of measurable impact we strive for.\\n\\nWould you be open to a 15-minute call to discuss your highest-priority technology initiatives for the year? I'm confident we could share some valuable insights.\\n\\nBest,\\n[Your Name]"
    },
    "phone": {
      "key_message": [
        "We're a technology consulting firm that specializes in helping leaders like you deliver major technology projects with a clear and measurable return on investment."
      ],
      "evidence_point": [
        "We recently helped a client in a highly regulated industry launch a new analytics platform that cut their reporting time by 80% and passed all compliance audits on the first review.",
        "We offer four engagement models, from talent augmentation to fully managed services, to meet our clients' specific needs across financial services, healthcare, government, and manufacturing.",
        "Whether you're on AWS, Azure, GCP, or hybrid environments, our team has the expertise to deliver."
      ],
      "engagement_question": [
        "When you think about your technology roadmap for the next 12 months, what's the one initiative that absolutely has to succeed?"
      ],
      "voicemail": [
        "Hi [Prospect Name], this is [Your Name] from Eliassen Group.",
        "We just helped a client cut their reporting time by 80% on a major project.",
        "I'd be happy to share how we deliver those kinds of results.",
                "You can reach me at [phone number]."
      ]
    },
    "linkedin": {
      "connection_request": "I help technology leaders deliver major projects with measurable ROI. Would enjoy connecting to share insights on technology success.",
      "inmessage_subject": "Cutting reporting time by 80%",
      "inmessage_body": "Hi [Prospect Name],\\n\\nLeading major technology projects comes with pressure to deliver real business value.\\n\\nWe recently helped a client launch a new platform that cut their reporting time by 80% and passed all compliance audits on the first go.\\n\\nWould you be open to a 25-minute conversation about how we deliver these kinds of measurable outcomes?\\n\\nBest,\\n[Your Name]"
    },
    "objections": [
      {
        "objection": "We already have technology partners we work with.",
        "response": "That's great, we believe in strong partnerships. We often work with our clients' existing partners, bringing specialized expertise to accelerate specific components. For one client, we helped their primary vendor complete a project 30% ahead of schedule."
      },
      {
        "objection": "We don't have the budget for new consulting engagements right now.",
        "response": "I understand that completely. Many of our most successful projects are self-funding, where the cost savings we identify in the first few months more than cover our fees. For example, we found over $1M in operational savings for a client last quarter."
      },
      {
        "objection": "We prefer to handle our technology initiatives internally.",
        "response": "That's a great goal, and we support it. Our most successful engagements end with your team being fully self-sufficient. We often help by providing targeted training or augmenting your team with a specific skill set to get a critical project over the line."
      }
    ],
    "collateral": {
      "title": "Eliassen Group Company Overview",
      "link": "https://www.eliassen.com/about"
    }
  }
} 