{
  "metadata": {
    "module_id": "intro_eliassen_group_overview",
    "title": "Introduction to Eliassen Group & Technology Solutions",
    "module_type": "Company Introduction",
    "practice_area": "General",
    "overview": "Eliassen Group is organized into 3 pillars: Technology Solutions, FRCA (Financial Risk & Compliance Advisory), and Clinical Solutions. Within Technology Solutions, we help clients achieve measurable outcomes across 5 practice areas: Application Development, Cybersecurity, AI & Data Services, Infrastructure & Cloud, and Enterprise Agility.",
    "relevant_roles": ["CTO", "VP Technology", "Director of IT", "Chief Data Officer", "VP Engineering"]
  },
  "content": {
    "email": {
      "subject": "Unlocking Solutions with Eliassen Group - A Quick Introduction",
      "body": "Hi [Prospect Name],\n\nI hope this note finds you well. I wanted to take a moment to introduce myself and Eliassen Group, and share how we might be able to support your team's goals.\n\nEliassen Group is a professional services firm with over 30 years of experience helping organizations solve complex challenges through tailored, high-impact solutions. We're proud to be recognized for our world-class Net Promoter Scores and long-standing client relationships.\n\nOur three core pillars include:\n\n1. Technology Solutions: From application development and cloud modernization to AI, cybersecurity, and data analytics, our teams deliver scalable solutions that drive innovation and efficiency.\n\n2. Financial, Risk & Compliance and Advisory Solutions: We help clients navigate regulatory landscapes, optimize risk management, and strengthen governance through expert consulting in SOX compliance, internal audit, and transformation initiatives.\n\n3. Clinical Solutions: Our clinical operations and data science teams support life sciences organizations with quality, regulatory, and operational excellence across the product lifecycle.\n\nWhether you're exploring new initiatives or looking to accelerate existing ones, Eliassen Group is ready to partner with you.\n\nWould you be open to a brief conversation to explore how we might support your priorities? Looking forward to connecting."
    },
    "phone": {
      "key_talking_points": [
        "Eliassen Group is a professional services firm with over 30 years of experience",
        "We have three core pillars: Technology Solutions, Financial Risk & Compliance Advisory, and Clinical Solutions",
        "We're recognized for world-class Net Promoter Scores and long-standing client relationships"
      ],
      "evidence_point": [
        "Over 30 years helping organizations solve complex challenges through tailored solutions",
        "World-class Net Promoter Scores demonstrate our commitment to client success",
        "Long-standing client relationships across multiple industries"
      ],
      "engagement_question": [
        "What are your team's biggest challenges or priorities for the coming year?",
        "Are you exploring any new initiatives where external expertise could be valuable?"
      ],
      "voicemail": [
        "Hi [Prospect Name], this is [Your Name] from Eliassen Group.",
        "I wanted to introduce myself and share how we help organizations solve complex challenges.",
        "I'd love to have a brief conversation about how we might support your priorities.",
        "Please call me back at [phone number] when convenient."
      ]
    },
    "linkedin": {
      "connection_request": "I help organizations solve complex challenges through tailored solutions across technology, risk & compliance, and clinical operations. Would enjoy connecting.",
      "inmessage_subject": "Following up on Eliassen Group introduction",
      "inmessage_body": "Hi [Prospect Name],\n\nI sent you an email introducing Eliassen Group and our three core pillars: Technology Solutions, Financial Risk & Compliance Advisory, and Clinical Solutions.\n\nWe help organizations solve complex challenges through tailored, high-impact solutions. Would love to have a brief conversation about how we might support your priorities.\n\nBest,\n[Your Name]"
    },
    "objections": [
      {
        "objection": "We already have technology partners we work with.",
        "response": "That's great - we often work alongside existing partners, bringing specialized expertise to accelerate specific components. We helped one client's primary vendor complete a project 30% ahead of schedule."
      },
      {
        "objection": "We don't have budget for new consulting engagements.",
        "response": "Many of our projects are self-funding - the cost savings we identify in first few months cover our fees. We found over $1M in operational savings for a client last quarter."
      },
      {
        "objection": "We prefer to handle technology initiatives internally.",
        "response": "That's the goal - our most successful engagements end with your team fully self-sufficient. We often provide targeted training or specific skill sets to get critical projects over the line."
      }
    ],
    "collateral": {
      "title": "Eliassen Group Technology Solutions Overview",
      "link": "https://www.eliassen.com/technology-solutions"
    }
  }
}