{
  "metadata": {
    "module_id": "talent_solutions_approach", 
    "title": "Talent Solutions Approach",
    "module_type": "Company Intro",
    "practice_area": "General",
    "relevant_roles": [
      "Chief Information Officer",
      "Chief Technology Officer",
      "VP of Information Technology", 
      "Director of IT",
      "IT Program Manager",
      "Director of Digital Transformation"
    ],
    "overview": "Eliassen Group's talent solutions combine deep technical vetting with practice-led oversight to deliver specialized consultants who integrate seamlessly with your team. Our approach emphasizes rapid deployment, quality assurance, and flexible engagement options to meet your specific capacity and expertise needs."
  },
  "content": {
    "email": {
      "subject": "Specialized technical talent with practice-led vetting",
      "body": "Hi [Prospect Name],\n\nFinding the right technical talent for critical projects shouldn't take months of recruiting and interviewing. That's why we've built a different approach.\n\nOur talent solutions combine:\n\n• **Practice-led technical vetting** - Our AI & Data, Cybersecurity, App Dev, Infrastructure, and Agile practice leaders personally screen candidates\n• **Rapid deployment** - Typically 6-8 weeks from decision to team in place\n• **Flexible engagement options** - From individual specialists to complete functional teams\n• **Ongoing oversight** - Practice leaders stay engaged to ensure quality and performance\n\nThis approach has helped us maintain industry-leading consultant and client satisfaction scores across 400+ active relationships.\n\nRecent example: A financial services client needed cybersecurity expertise for a compliance deadline just 10 weeks away. We deployed a vetted team of 4 specialists in 3 weeks who successfully passed their audit on first review.\n\nWould you be open to a 20-minute conversation about your current staffing challenges or upcoming project needs?\n\nBest,\n[Your Name]\nEliassen Group Technology Solutions"
    },
    "phone": {
      "key_talking_points": [
        "We provide specialized technical talent vetted by our practice leaders, not just recruiters",
        "Typical deployment is 6-8 weeks from decision to consultant in place",
        "Our practice leaders stay engaged throughout the engagement for quality assurance"
      ],
      "evidence_point": [
        "Recently helped a client meet a 10-week compliance deadline by deploying 4 cybersecurity specialists in 3 weeks",
        "Our consultants integrate with your team while our practice leaders provide ongoing oversight and support",
        "We maintain industry-leading satisfaction scores because of our focus on the right fit, not just any fit"
      ],
      "engagement_question": [
        "What's your biggest challenge when it comes to finding specialized technical talent?",
        "Are there any upcoming projects where additional expertise could accelerate delivery?"
      ],
      "voicemail": [
        "Hi [Prospect Name], this is [Your Name] from Eliassen Group.",
        "We just helped a client deploy 4 cybersecurity specialists in 3 weeks for a critical compliance deadline.",
        "I'd love to discuss how our practice-led talent approach could help your team.",
        "Please call me back at [phone number] for a 20-minute conversation."
      ]
    },
    "linkedin": {
      "connection_request": "I help technology leaders access specialized talent through practice-led vetting. Would enjoy connecting.",
      "inmessage_subject": "Following up on talent solutions email",
      "inmessage_body": "Hi [Prospect Name],\n\nShot you over an email about our practice-led talent approach. We recently helped a client deploy 4 cybersecurity specialists in just 3 weeks for a critical deadline.\n\nWould love 20 minutes to discuss how we could help with your staffing challenges.\n\nBest,\n[Your Name]"
    },
    "objections": [
      {
        "objection": "We have our own recruiting team and prefer to hire full-time employees.",
        "response": "That's a great long-term strategy. Many clients use our consultants to bridge gaps while they recruit, or to bring in specialized expertise for specific projects. Our consultants often help train your permanent hires."
      },
      {
        "objection": "Contract rates are typically higher than employee costs.",
        "response": "True on hourly rates, but when you factor in benefits, recruiting costs, and ramp-up time, the total cost is often comparable. Plus, you get immediate expertise and flexibility to scale based on project needs."
      },
      {
        "objection": "We've had issues with consultant quality from other firms.",
        "response": "That's exactly why we have practice leaders personally vet every consultant. We're not just a recruiting firm - our technical experts ensure the right fit for your specific needs and stay engaged throughout the engagement."
      },
      {
        "objection": "We need people who can integrate with our team culture.",
        "response": "Cultural fit is part of our vetting process. Our consultants are selected not just for technical skills but for their ability to collaborate effectively. Many become extended team members who clients want to convert to full-time."
      }
    ],
    "collateral": {
      "title": "Eliassen Group Talent Solutions Overview",
      "link": "https://www.eliassen.com/talent-solutions"
    }
  }
}